<?php

namespace Database\Seeders;

use App\Models\NursingHomeProfile;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use App\Enums\UserType;

class NursingHomeProfilesSeeder extends Seeder
{
    public function run()
    {
        NursingHomeProfile::query()->insert([
            [
                'id' => 1,
                'user_id' => 13,
                'name' => 'Diana Garden Resort Pattaya',
                'description' => 'ศูนย์ดูแลผู้สูงอายุและผู้ป่วยระยะฟื้นฟูแบบครบวงจรและทันสมัยที่สุดในจังหวัดชลบุรี โดยบ้านลลิสา Nursing Home พัทยา เปิดให้บริการดูแลผู้ป่วยในโปรแกรมต่างๆได้แก่ โปรแกรมดูแลผู้สูงอายุ โปรแกรมดูแลผู้ป่วยติดเตียงโปรแกรมดูแลผู้ป่วย
อัมพฤกษ์อัมพาต โปรแกรมดูแลผู้ป่วยอัลไซเมอร์ โปรแกรมดูแลผู้ป่วยหลังผ่าตัดและโปรแกรมรักษาอาการปวดเรื้อรังจุดมุ่ง
หมายของบ้านลลิสาคือการให้บริการการดูแลรักษาผู้ป่วยที่ได้มาตรฐานที่ดีที่สุด"ดูแลโดยทีมบุคลากรทางการแพทย์ผู้เชี่ยวชาญตลอด 24 ชั่วโมง" สาขาที่ให้บริการของบ้านลลิสาทุกสาขามุ่งเน้นให้ทุกคนอาศัยอยู่ในที่ที่สะดวกสบายร่มรื่นและสร้างมาเพื่อการ
อยู่อาศัยและคำนึงถึงความปลอดภัยของผู้สูงอายุ ให้ผู้ป่วยที่เข้ารับการฟื้นฟูทุกท่าน มีสังคมและเพื่อนและได้รับการดูแลอย่าง
ใกล้ชิดจากพยาบาลและผู้ช่วยพยาบาลที่มีประสบการณ์พร้อมได้รับประโยชน์จากกิจกรรมบำบัดและกิจกรรมเสริมที่ส่งเสริมคุณภาพชีวิตทั้งสุขภาพกายและสุขภาพจิต',
                'main-phone' => '0969532445',
                'res-phone' => '0969532445',
                'facebook' => 'https://facebook.com',
                'website' => 'https://facebook.com',
                'address' => '1234',
                'province_id' => 50,
                'district_id' => 5001,
                'sub_district_id' => 500101,
                'zipcode' => 50000
            ],
        ]);
    }
}
