<?php

namespace Database\Seeders;

use App\Models\NursingProfile;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use App\Enums\UserType;

class NursingProfilesSeeder extends Seeder
{
    public function run()
    {
        NursingProfile::query()->insert([
            [
                'id' => 1,
                'user_id' => 3,
                'name' => 'อุณณัญวร จันทร์สว่าง (อุณ)',
                'religion' => 'BUDDHIST',
                'about' => 'ศูนย์ดูแลผู้สูงอายุและผู้ป่วยระยะฟื้นฟูแบบครบวงจรและทันสมัยที่สุดในจังหวัดชลบุรี โดยบ้านลลิสา Nursing Home พัทยา เปิดให้บริการดูแลผู้ป่วยในโปรแกรมต่างๆได้แก่ โปรแกรมดูแลผู้สูงอายุ โปรแกรมดูแลผู้ป่วยติดเตียงโปรแกรมดูแลผู้ป่วยอัมพฤกษ์อัมพาต โปรแกรมดูแลผู้ป่วยอัลไซเมอร์ โปรแกรมดูแลผู้ป่วยหลังผ่าตัดและโปรแกรมรักษาอาการปวดเรื้อรังจุดมุ่งหมายของบ้านลลิสาคือการให้บริการการดูแลรักษาผู้ป่วยที่ได้มาตรฐานที่ดีที่สุด"ดูแลโดยทีมบุคลากรทางการแพทย์ผู้เชี่ยวชาญตลอด 24 ชั่วโมง" สาขาที่ให้บริการของบ้านลลิสาทุกสาขามุ่งเน้นให้ทุกคนอาศัยอยู่ในที่ที่สะดวกสบายร่มรื่นและสร้างมาเพื่อการอยู่อาศัยและคำนึงถึงความปลอดภัยของผู้สูงอายุ ให้ผู้ป่วยที่เข้ารับการฟื้นฟูทุกท่าน มีสังคมและเพื่อนและได้รับการดูแลอย่าง ใกล้ชิดจากพยาบาลและผู้ช่วยพยาบาลที่มีประสบการณ์พร้อมได้รับประโยชน์จากกิจกรรมบำบัดและกิจกรรมเสริมที่ส่งเสริมคุณภาพชีวิตทั้งสุขภาพกายและสุขภาพจิต',
                'gender' => 'FEMALE',
                'cost' => 1800.00,
                'date_of_birth' => '1986-03-25',
                'nationality' => 'THAI',
                'province_id' => 50,
                'district_id' => 5001,
                'sub_district_id' => 500101,
                'zipcode' => 50000
            ],
            [
                'id' => 2,
                'user_id' => 4,
                'name' => 'นันทิชา ธรรมภักดิ์ (ปาย)',
                'religion' => 'BUDDHIST',
                'gender' => 'FEMALE',
                'date_of_birth' => '1986-03-25',
                'nationality' => 'THAI',
                'cost' => 2750.00,
                'about' => 'ศูนย์ดูแลผู้สูงอายุและผู้ป่วยระยะฟื้นฟูแบบครบวงจร และทันสมัยที่สุดในจังหวัดเชียงราย โดยบ้านลลิสา Nursing Home เชียงราย เปิดให้บริการดูแลผู้ป่วยในโปรแกรมต่าง ๆ ได้แก่ โปรแกรมดูแลผู้สูงอายุ โปรแกรมดูแลผู้ป่วยติดเตียง โปรแกรมดูแลผู้ป่วยอัมพฤกษ์อัมพาต โปรแกรมดูแลผู้ป่วยอัลไซเมอร์ โปรแกรมดูแลผู้ป่วยหลังผ่าตัด และโปรแกรมรักษาอาการปวดเรื้อรัง',
                'province_id' => 50,
                'district_id' => 5002,
                'sub_district_id' => 500203,
                'zipcode' => 500203,
            ],
            [
                'id' => 3,
                'user_id' => 5,
                'name' => 'สุรพล จันทร์สว่างวงศ์ (แทน)',
                'religion' => 'BUDDHIST',
                'date_of_birth' => '1986-03-25',
                'gender' => 'FEMALE',
                'cost' => 1850.00,
                'nationality' => 'THAI',
                'about' => 'ศูนย์บ้านลลิสาเนอร์ซิ่งโฮม พิษณุโลก ตั้งอยู่ใจกลางเมืองตัวเมืองพิษณุโลก เป็นบ้านชั้นเดียวขนาดใหญ่ ให้ความรู้สึกอบอุ่นเหมือนอยู่บ้าน ดูแลโดยทีมแพทย์และพยาบาลตลอด 24 ชั่วโมง มีนักโภชนาการ และนักกายภาพประจำศูนย์ เหมาะสำหรับคนไข้พักฟื้น และคนไข้ติดเตียง ศูนย์ของเราคำนึงถึงสภาพแวดล้อมและความเป็นอยู่ทั้งด้านสุขภาพกายและสุขภาพจิตของผู้ป่วยที่เข้ารับการรักษา ณ บ้านผู้สูงอายุ ศูนย์พิษณุโลกของเราออกแบบเพื่อเอื้อต่อการรักษาและฟื้นฟูของผู้เข้ารับการรักษาเป็นสำคัญ',
                'province_id' => 50,
                'district_id' => 5003,
                'sub_district_id' => 500301,
                'zipcode' => 500301,
            ],
            [
                'id' => 4,
                'user_id' => 6,
                'name' => 'ชุติภรณ์ รักดี (ชุติ)',
                'religion' => 'BUDDHIST',
                'nationality' => 'THAI',
                'cost' => 1950.00,
                'date_of_birth' => '1986-03-25',
                'gender' => 'FEMALE',
                'about' => 'ศูนย์บ้านลลิสาเนอร์ซิ่งโฮม กำแพงเพชร ตั้งอยู่ใจกลางเมือง เป็นศูนย์ดูแลผู้สูงอายุครบวงจรแห่งแรกในจังหวัดกำแพงเพชร ที่ออกแบบด้วยรูปแบบทันสมัย น่าอยู่ แต่ยังคงมาตรฐานความปลอดภัย โดยการคำนึงถึงการเคลื่อนย้ายและการใช้ชีวิตของผู้ป่วย เป็นหลัก พร้อมให้การดูแลโดยทีมแพทย์และพยาบาลตลอด 24 ชั่วโมง มีนักโภชนาการ และนักกายภาพประจำศูนย์ เหมาะสำหรับคนไข้พักฟื้นและคนไข้ติดเตียง รวมไปถึงผู้สูงอายุที่ต้องการการดูแล',
                'province_id' => 50,
                'district_id' => 5004,
                'sub_district_id' => 500402,
                'zipcode' => 500402,
            ],
            
        ]);
    }
}
