<?php

namespace Database\Seeders;

use App\Models\NursingHomeProfile;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use App\Enums\UserType;

class NursingHomeProfilesSeeder extends Seeder
{
    public function run()
    {
        NursingHomeProfile::query()->insert([
            [
                'id' => 1,
                'user_id' => 13,
                'name' => 'Diana Garden Resort Pattaya',
                'description' => 'ศูนย์ดูแลผู้สูงอายุและผู้ป่วยระยะฟื้นฟูแบบครบวงจรและทันสมัยที่สุดในจังหวัดชลบุรี โดยบ้านลลิสา Nursing Home พัทยา เปิดให้บริการดูแลผู้ป่วยในโปรแกรมต่างๆได้แก่ โปรแกรมดูแลผู้สูงอายุ โปรแกรมดูแลผู้ป่วยติดเตียงโปรแกรมดูแลผู้ป่วย
อัมพฤกษ์อัมพาต โปรแกรมดูแลผู้ป่วยอัลไซเมอร์ โปรแกรมดูแลผู้ป่วยหลังผ่าตัดและโปรแกรมรักษาอาการปวดเรื้อรังจุดมุ่ง
หมายของบ้านลลิสาคือการให้บริการการดูแลรักษาผู้ป่วยที่ได้มาตรฐานที่ดีที่สุด"ดูแลโดยทีมบุคลากรทางการแพทย์ผู้เชี่ยวชาญตลอด 24 ชั่วโมง" สาขาที่ให้บริการของบ้านลลิสาทุกสาขามุ่งเน้นให้ทุกคนอาศัยอยู่ในที่ที่สะดวกสบายร่มรื่นและสร้างมาเพื่อการ
อยู่อาศัยและคำนึงถึงความปลอดภัยของผู้สูงอายุ ให้ผู้ป่วยที่เข้ารับการฟื้นฟูทุกท่าน มีสังคมและเพื่อนและได้รับการดูแลอย่าง
ใกล้ชิดจากพยาบาลและผู้ช่วยพยาบาลที่มีประสบการณ์พร้อมได้รับประโยชน์จากกิจกรรมบำบัดและกิจกรรมเสริมที่ส่งเสริมคุณภาพชีวิตทั้งสุขภาพกายและสุขภาพจิต',
                'main-phone' => '0969532445',
                'res-phone' => '0969532445',
                'facebook' => 'https://facebook.com',
                'website' => 'https://facebook.com',
                'address' => '1234',
                'province_id' => 50,
                'district_id' => 5001,
                'sub_district_id' => 500101,
                'zipcode' => 50000
            ],
            [
                'id' => 2,
                'user_id' => 14,
                'name' => 'บ้านลลิสาเนอร์ซิ่งโฮม สาขาเชียงราย',
                'description' => 'ศูนย์ดูแลผู้สูงอายุและผู้ป่วยระยะฟื้นฟูแบบครบวงจร และทันสมัยที่สุดในจังหวัดเชียงราย โดยบ้านลลิสา Nursing Home เชียงราย เปิดให้บริการดูแลผู้ป่วยในโปรแกรมต่าง ๆ ได้แก่ โปรแกรมดูแลผู้สูงอายุ โปรแกรมดูแลผู้ป่วยติดเตียง โปรแกรมดูแลผู้ป่วยอัมพฤกษ์อัมพาต โปรแกรมดูแลผู้ป่วยอัลไซเมอร์ โปรแกรมดูแลผู้ป่วยหลังผ่าตัด และโปรแกรมรักษาอาการปวดเรื้อรัง',
                'main-phone' => '1111111111',
                'res-phone' => '2222222222',
                'facebook' => 'https://facebook.com',
                'website' => 'https://facebook.com',
                'address' => '1234',
                'province_id' => 57,
                'district_id' => 5701,
                'sub_district_id' => 570113,
                'zipcode' => 57000,
                'address' => '44'
            ],
            [
                'id' => 3,
                'user_id' => 15,
                'name' => 'บ้านลลิสา สาขาพิษณุโลก',
                'description' => 'ศูนย์บ้านลลิสาเนอร์ซิ่งโฮม พิษณุโลก ตั้งอยู่ใจกลางเมืองตัวเมืองพิษณุโลก เป็นบ้านชั้นเดียวขนาดใหญ่ ให้ความรู้สึกอบอุ่นเหมือนอยู่บ้าน ดูแลโดยทีมแพทย์และพยาบาลตลอด 24 ชั่วโมง มีนักโภชนาการ และนักกายภาพประจำศูนย์ เหมาะสำหรับคนไข้พักฟื้น และคนไข้ติดเตียง ศูนย์ของเราคำนึงถึงสภาพแวดล้อมและความเป็นอยู่ทั้งด้านสุขภาพกายและสุขภาพจิตของผู้ป่วยที่เข้ารับการรักษา ณ บ้านผู้สูงอายุ ศูนย์พิษณุโลกของเราออกแบบเพื่อเอื้อต่อการรักษาและฟื้นฟูของผู้เข้ารับการรักษาเป็นสำคัญ',
                'main-phone' => '333333333',
                'res-phone' => '4444444444',
                'facebook' => 'https://facebook.com',
                'website' => 'https://facebook.com',
                'address' => '1234',
                'province_id' => 65,
                'district_id' => 6501,
                'sub_district_id' => 650103,
                'zipcode' => 65000,
                'address' => '957, 29 ซอย พรรณเพียร'
            ],
            [
                'id' => 4,
                'user_id' => 16,
                'name' => 'บ้านลลิสา สาขากำแพงเพชร',
                'description' => 'ศูนย์บ้านลลิสาเนอร์ซิ่งโฮม กำแพงเพชร ตั้งอยู่ใจกลางเมือง เป็นศูนย์ดูแลผู้สูงอายุครบวงจรแห่งแรกในจังหวัดกำแพงเพชร ที่ออกแบบด้วยรูปแบบทันสมัย น่าอยู่ แต่ยังคงมาตรฐานความปลอดภัย โดยการคำนึงถึงการเคลื่อนย้ายและการใช้ชีวิตของผู้ป่วย เป็นหลัก พร้อมให้การดูแลโดยทีมแพทย์และพยาบาลตลอด 24 ชั่วโมง มีนักโภชนาการ และนักกายภาพประจำศูนย์ เหมาะสำหรับคนไข้พักฟื้นและคนไข้ติดเตียง รวมไปถึงผู้สูงอายุที่ต้องการการดูแล',
                'main-phone' => '5555555555',
                'res-phone' => '6666666666',
                'facebook' => 'https://facebook.com',
                'website' => 'https://facebook.com',
                'address' => '1234',
                'province_id' => 62,
                'district_id' => 6201,
                'sub_district_id' => 620101,
                'zipcode' => 62000,
                'address' => '770 ราชดำเนิน 1'
            ],
            
        ]);
    }
}
